# Folder Item Info Methods

Source: https://www.revitapidocs.com/2026/eaa536da-69b7-d96b-7ba7-03a943a0654d.htm

---

| Folder Item Info Methods |
| --- |

The FolderItemInfo type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetGroupingParameterIdPath | The parameter Id path used to determine the folder items in the browser. |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

FolderItemInfo Class Autodesk.Revit.DB Namespace